In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [2]:
left2=pd.DataFrame([[1.,1.],[3.,4.],[5.,6.]],index=['a','c','e'],columns=['Ohio','Nevada'])
right2=pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],index=['b','c','d','e'],columns=['Missouri','Alabama'])

In [3]:
left2

   Ohio  Nevada
a   1.0     1.0
c   3.0     4.0
e   5.0     6.0

In [4]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [14]:
pd.merge(left2,right2,left_index=True,right_index=True,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     1.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [17]:
pd.concat([left2,right2],sort=True)

   Alabama  Missouri  Nevada  Ohio
a      NaN       NaN     1.0   1.0
c      NaN       NaN     4.0   3.0
e      NaN       NaN     6.0   5.0
b      8.0       7.0     NaN   NaN
c     10.0       9.0     NaN   NaN
d     12.0      11.0     NaN   NaN
e     14.0      13.0     NaN   NaN